#### Terraform Format and Style 🖌``
#### Terraform Initialization ⚙️`success`
#### Terraform Plan 📖`success`
<details><summary>Show Plan</summary>
```terraform
Running plan in the remote backend. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

The remote workspace is configured to work with configuration at
environment relative to the target repository.

Terraform will upload the contents of the following directory,
excluding files or directories as defined by a .terraformignore file
at /home/runner/work/rw-test-nikhil/rw-test-nikhil/.terraformignore (if it is present),
in order to capture the filesystem context the remote workspace expects:
    /home/runner/work/rw-test-nikhil/rw-test-nikhil

To view this run in a browser, visit:
https://app.terraform.io/app/rw-test/nwps-reportwriting-core-development/runs/run-mF5pzUv9Ys4A8Yo5

Waiting for the plan to start...

Terraform v0.14.2
Configuring remote state backend...
Initializing Terraform configuration...
module.ecs.aws_ecs_cluster.fargate: Refreshing state... [id=arn:aws-us-gov:ecs:us-gov-west-1:750436205735:cluster/reportwriting-dev2]
module.authorizer.module.authorizer.aws_iam_role.authorizer: Refreshing state... [id=reportwriting-dev2-gateway-authorizer-role]
module.rwservice-artifacts.aws_sqs_queue.queue: Refreshing state... [id=https://sqs.us-gov-west-1.amazonaws.com/750436205735/rwserviceprod-upload-queue]
module.authorizer.module.authorizer.aws_cloudwatch_log_group.distributor: Refreshing state... [id=/aws/lambda/reportwriting-dev2-gateway-authorizer]
module.bridge_api_ecs_service.aws_cloudwatch_log_group.log_group: Refreshing state... [id=/ecs/reportwriting-dev2/bridge-api]
module.ecs.aws_iam_role.ecs_task_assume: Refreshing state... [id=reportwriting-dev2_ecs_task_execution]
module.bridge_api_ecs_service.aws_iam_role.ecs_task: Refreshing state... [id=bridge-api_ecs-task]
module.rwservice-artifacts.aws_iam_user.deploy_user: Refreshing state... [id=rwserviceprod-deploy]
module.vpc.aws_vpc.vpc: Refreshing state... [id=vpc-0c8eae6e662bb9810]
module.rwservice-artifacts.aws_iam_user.github_user: Refreshing state... [id=github-action-rwserviceprod]
module.authorizer.module.policy.aws_dynamodb_table.policy: Refreshing state... [id=reportwriting-dev2-gateway-authorizer-policy]
module.rwservice-artifacts.aws_s3_bucket.s3: Refreshing state... [id=rwserviceprod-artifacts]
module.bridge_api.aws_ecr_repository.ecr: Refreshing state... [id=bridge-api]
aws_cognito_user_pool.pool: Refreshing state... [id=us-gov-west-1_QOrLTdbkY]
module.bridge_api_ecs_service.aws_iam_role_policy.ecs_task: Refreshing state... [id=bridge-api_ecs-task:reportwriting-dev2_bridge-api_ecs_task]
module.ecs.aws_iam_role_policy.ecs_task_assume: Refreshing state... [id=reportwriting-dev2_ecs_task_execution:reportwriting-dev2_ecs_task_execution]
module.bridge_api_ecs_service.aws_ecs_task_definition.task_defition: Refreshing state... [id=bridge-api]
aws_cognito_user_pool_domain.domain: Refreshing state... [id=reportwriting-dev2]
module.authorizer.module.authorizer.aws_iam_role_policy.dynamodb: Refreshing state... [id=reportwriting-dev2-gateway-authorizer-role:dynamodb-policy]
module.authorizer.module.authorizer.aws_lambda_function.authorizer: Refreshing state... [id=reportwriting-dev2-gateway-authorizer]
module.authorizer.module.authorizer.aws_iam_role_policy.invoke_lambda: Refreshing state... [id=reportwriting-dev2-gateway-authorizer-role:lambda-policy]
module.authorizer.module.authorizer.aws_iam_role_policy_attachment.authorizer_basic: Refreshing state... [id=reportwriting-dev2-gateway-authorizer-role-20210628143804120600000001]
module.vpc.aws_route_table.private: Refreshing state... [id=rtb-0b1caadfb531b40fd]
module.bridge_api_listener.aws_alb_target_group.alb_target_group: Refreshing state... [id=arn:aws-us-gov:elasticloadbalancing:us-gov-west-1:750436205735:targetgroup/bridge-api-listener/e0a69aa5a4d6852f]
module.vpc.aws_subnet.private[0]: Refreshing state... [id=subnet-0bdb3877601d1ea6a]
module.vpc.aws_subnet.private[1]: Refreshing state... [id=subnet-04794222a2f08dfd4]
module.vpc.aws_route_table.public: Refreshing state... [id=rtb-010f3a672f926999f]
module.vpc.aws_internet_gateway.ig: Refreshing state... [id=igw-018ddbbc8e1cf447b]
module.vpc.aws_subnet.public[1]: Refreshing state... [id=subnet-00cf37b3f16af4a35]
module.vpc.aws_subnet.public[0]: Refreshing state... [id=subnet-0998ab1d1cc5c1cb9]
module.vpc.aws_security_group.default: Refreshing state... [id=sg-0a9b2d4ddaf546bfb]
module.ecs_sg.aws_security_group.sg: Refreshing state... [id=sg-02a3b92b19e9d1ddc]
module.vpc.aws_eip.nat_eip: Refreshing state... [id=eipalloc-040208d3cbbbb4876]
module.vpc.aws_route.public: Refreshing state... [id=r-rtb-010f3a672f926999f1080289494]
module.vpc.aws_route_table_association.private[1]: Refreshing state... [id=rtbassoc-0cabc55ba40742dac]
module.vpc.aws_route_table_association.private[0]: Refreshing state... [id=rtbassoc-0d0c1022b97252073]
module.vpc.aws_route_table_association.public[0]: Refreshing state... [id=rtbassoc-033de90a69d50a18c]
module.vpc.aws_route_table_association.public[1]: Refreshing state... [id=rtbassoc-0a3058878b6b5d6fc]
module.lb_public.aws_lb.lb: Refreshing state... [id=arn:aws-us-gov:elasticloadbalancing:us-gov-west-1:750436205735:loadbalancer/net/reportwriting-dev2-public-lb/7457883aed0130f0]
module.vpc.aws_nat_gateway.nat: Refreshing state... [id=nat-039f74b96cf1d743c]
module.public_alb_sg.aws_security_group.sg: Refreshing state... [id=sg-060aeba0b8908e257]
aws_security_group_rule.ecs_ecs_egress: Refreshing state... [id=sgrule-772438953]
aws_security_group_rule.ecs_https_egress: Refreshing state... [id=sgrule-3172122339]
aws_security_group_rule.ecs_ecs_ingress: Refreshing state... [id=sgrule-1534262163]
module.private_alb_sg.aws_security_group.sg: Refreshing state... [id=sg-06c42e660791a1fa0]
module.vpc.aws_route.private: Refreshing state... [id=r-rtb-0b1caadfb531b40fd1080289494]
aws_security_group_rule.ecs_public_alb_ingress: Refreshing state... [id=sgrule-472576686]
module.alb_public.aws_alb.alb: Refreshing state... [id=arn:aws-us-gov:elasticloadbalancing:us-gov-west-1:750436205735:loadbalancer/app/reportwriting-dev2-public-alb/c8049a23340e7757]
aws_security_group_rule.ecs_private_alb_ingress: Refreshing state... [id=sgrule-3970214904]
module.alb_private.aws_alb.alb: Refreshing state... [id=arn:aws-us-gov:elasticloadbalancing:us-gov-west-1:750436205735:loadbalancer/app/reportwriting-dev2-private-alb/570ec8b3420ba176]
module.rwservice-artifacts.aws_sqs_queue_policy.queue_policy: Refreshing state... [id=https://sqs.us-gov-west-1.amazonaws.com/750436205735/rwserviceprod-upload-queue]
module.rwservice-artifacts.aws_iam_user_policy.s3_rw: Refreshing state... [id=github-action-rwserviceprod:rwserviceprod-artifacts-rw]
module.rwservice-artifacts.aws_iam_user_policy.s3_ro: Refreshing state... [id=rwserviceprod-deploy:rwserviceprod-artifacts-ro]
module.rwservice-artifacts.aws_s3_bucket_notification.bucket_notification: Refreshing state... [id=rwserviceprod-artifacts]

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.bridge_api_ecs_service.aws_ecs_service.ecs_service will be created
  + resource "aws_ecs_service" "ecs_service" {
      + cluster                            = "arn:aws-us-gov:ecs:us-gov-west-1:750436205735:cluster/reportwriting-dev2"
      + deployment_maximum_percent         = 200
      + deployment_minimum_healthy_percent = 100
      + desired_count                      = 0
      + enable_ecs_managed_tags            = false
      + enable_execute_command             = false
      + iam_role                           = (known after apply)
      + id                                 = (known after apply)
      + launch_type                        = "FARGATE"
      + name                               = "bridge-api"
      + platform_version                   = (known after apply)
      + scheduling_strategy                = "REPLICA"
      + tags_all                           = (known after apply)
      + task_definition                    = "arn:aws-us-gov:ecs:us-gov-west-1:750436205735:task-definition/bridge-api:4"
      + wait_for_steady_state              = false

      + load_balancer {
          + container_name   = "bridge-api"
          + container_port   = 80
          + target_group_arn = "arn:aws-us-gov:elasticloadbalancing:us-gov-west-1:750436205735:targetgroup/bridge-api-listener/e0a69aa5a4d6852f"
        }

      + network_configuration {
          + assign_public_ip = true
          + security_groups  = [
              + "sg-02a3b92b19e9d1ddc",
            ]
          + subnets          = [
              + "subnet-04794222a2f08dfd4",
              + "subnet-0bdb3877601d1ea6a",
            ]
        }
    }

  # module.bridge_api_listener.aws_alb_listener.alb_listener will be created
  + resource "aws_alb_listener" "alb_listener" {
      + arn               = (known after apply)
      + certificate_arn   = "arn:aws-us-gov:acm:us-gov-west-1:750436205735:certificate/6b7aa4da-91dc-4c32-ae17-4b2457f9ba14"
      + id                = (known after apply)
      + load_balancer_arn = "arn:aws-us-gov:elasticloadbalancing:us-gov-west-1:750436205735:loadbalancer/app/reportwriting-dev2-public-alb/c8049a23340e7757"
      + port              = 8903
      + protocol          = "HTTPS"
      + ssl_policy        = (known after apply)
      + tags_all          = (known after apply)

      + default_action {
          + order            = (known after apply)
          + target_group_arn = "arn:aws-us-gov:elasticloadbalancing:us-gov-west-1:750436205735:targetgroup/bridge-api-listener/e0a69aa5a4d6852f"
          + type             = "forward"
        }
    }

Plan: 2 to add, 0 to change, 0 to destroy.

Warning: Interpolation-only expressions are deprecated

  on ../modules/compute/ecs/service/main.tf line 47, in data "template_file" "image_template":
  47:   template = "${file("${path.module}/image.json.tpl")}"

Terraform 0.11 and earlier required all non-constant expressions to be
provided via interpolation syntax, but this pattern is now deprecated. To
silence this warning, remove the "${ sequence from the start and the }"
sequence from the end of this expression, leaving just the inner expression.

Template interpolation syntax is still used to construct strings from
expressions when the template includes multiple interpolation sequences or a
mixture of literal strings and interpolations. This deprecation applies only
to templates that consist entirely of a single interpolation sequence.

(and 15 more similar warnings elsewhere)

```
</details>
*Pusher: @nikhil-lfc, Action: `pull_request`*